In [1]:
%pwd

'C:\\Users\\josh\\Documents\\fintech_homework\\homework2\\PyBank'

In [11]:
import pandas as pd

In [12]:
pd.read_csv('Resources/budget_data.csv')

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [8]:
%pwd

'C:\\Users\\josh\\Documents\\fintech_homework\\homework2\\PyBank'

In [13]:
totMonths = 0

In [10]:
totMonths = 0

In [11]:
netTotPL = 0

In [12]:
aveDeltaPL = 0

In [13]:
grIncreaseP = 0

In [14]:
grDecreaseL = 0

In [15]:
grDecreaseP = 0

In [16]:
count = 0

In [18]:
df

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [19]:
type (df)

pandas.core.frame.DataFrame

In [7]:
import pandas as pd

In [8]:
pd.read_csv('Resources/budget_data.csv')

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [10]:
#budget_data (date , PnL)

#for date in budget_data:
#    netTotPL = netTotPL + PnL
#    count = count + 1

#totMonths = count
#netTotPL

#aveDeltaPL = netTotPL / count

# row = 0
#diff_PnL = PnL[row +1] - PnL[row]
#grIncreaseP = max diff_PnL
#grDecreaseP = min diffPnL

#header = ['Financial Analysis']
#header2 = ['-----------------------']

In [36]:
print(df.iloc[0])

Date             Jan-2010
Profit/Losses      867884
Name: 0, dtype: object

In [37]:
Resources/budget_data.csv.describe

NameError: name 'Resources' is not defined

In [38]:
df.describe

<bound method NDFrame.describe of         Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]>

In [39]:
df

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [41]:
df.sum(axis=0)

Date             Jan-2010Feb-2010Mar-2010Apr-2010May-2010Jun-20...
Profit/Losses                                             38382578
dtype: object

In [44]:
sum(df['Profit/Losses'])

38382578

In [46]:
df['Profit/Losses-1'] = df['Profit/Losses'].shift(1)
df['netTotPL'] = df['Profit/Losses'] - df['Profit/Losses-1']
df

        Date  Profit/Losses  Profit/Losses-1  netTotPL
0   Jan-2010         867884              NaN       NaN
1   Feb-2010         984655         867884.0  116771.0
2   Mar-2010         322013         984655.0 -662642.0
3   Apr-2010         -69417         322013.0 -391430.0
4   May-2010         310503         -69417.0  379920.0
..       ...            ...              ...       ...
81  Oct-2016         102685         768450.0 -665765.0
82  Nov-2016         795914         102685.0  693229.0
83  Dec-2016          60988         795914.0 -734926.0
84  Jan-2017         138230          60988.0   77242.0
85  Feb-2017         671099         138230.0  532869.0

[86 rows x 4 columns]

In [48]:
min(df['netTotPL'][1:])

-2196167.0

In [49]:
max(df['netTotPL'][1:])

1926159.0

In [51]:
(df['netTotPL'][1:]).mean()

-2315.1176470588234

In [55]:
print(f"Greatest Increaase in Profits: {max(df['netTotPL'][1:])}")

Greatest Increaase in Profits: 1926159.0

In [103]:
print ("Financial Analysis")
print ("--------------------")

print(f"Total Months: {len(df['Profit/Losses'])}")
print(f"Total : ${sum(df['Profit/Losses'])}")

print(f"Greatest Increaase in Profits: {max(df['netTotPL'][1:])}")
print(f"Greatest Decrease in Profits: {min(df['netTotPL'][1:])}")

Financial Analysis
--------------------
Total Months: 86
Total : $38382578
Greatest Increaase in Profits: 1926159.0
Greatest Decrease in Profits: -2196167.0

In [71]:
len(df['Profit/Losses'])

86

In [75]:
print(f"Total : {sum(df[$:'Profit/Losses'])}")

SyntaxError: invalid syntax (<fstring>, line 1)

In [79]:
print(f"Total :   ${sum(df['Profit/Losses'])}")

Total :   $38382578

In [82]:
(df['netTotPL'][1:]).mean()

-2315.1176470588234

In [89]:
print(f"Greatest Increaase in Profits: {max(df['netTotPL'][1:])}")

Greatest Increaase in Profits: 1926159.0

In [99]:
print(f"Average Change"{(df['netTotPL'][1:]).mean())}")

SyntaxError: invalid syntax (Temp/ipykernel_1640/4286336305.py, line 1)

In [100]:
print((max(df['netTotPL'][1:]))

1926159.0

In [105]:
print ("Financial Analysis")
print ("--------------------")

print(f"Total Months: {len(df['Profit/Losses'])}")
print(f"Total : ${sum(df['Profit/Losses'])}")
print(f"Average Change: {(df['netTotPL'][1:]).mean()}")
print(f"Greatest Increaase in Profits: {max(df['netTotPL'][1:])}")
print(f"Greatest Decrease in Profits: {min(df['netTotPL'][1:])}")

Financial Analysis
--------------------
Total Months: 86
Total : $38382578
Average Change: -2315.1176470588234
Greatest Increaase in Profits: 1926159.0
Greatest Decrease in Profits: -2196167.0